Revit 2027 API
WallCrossSection Enumeration
 The allowed values for the WALL_CROSS_SECTION parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallCrossSection
Public Enumeration WallCrossSection
public enum class WallCrossSection
type WallCrossSection
Members
Member name | Value | Description
SingleSlanted | 0 |  A single-slanted wall whose angle is controlled by the parameter WALL_SINGLE_SLANT_ANGLE_FROM_VERTICAL.
Tapered | 2 |  A tapered wall whose angle is controlled by the parameters WALL_TAPERED_EXTERIOR_INWARD_ANGLE and WALL_TAPERED_INTERIOR_INWARD_ANGLE.
Vertical | 1 |  A vertical wall, 0 degrees.
See Also
Reference
Autodesk.Revit.DB Namespace